{
  "FullName": "Tirumala Rao Sodipalli",
  "Title": "Solution Architect",
  "Email": "s.tirumal@gmail.com",
  "Phone": "+91-9620027500",
  "LinkedInUrl": "https://www.linkedin.com/in/tirumala-rao-s/",
  "GitHubUrl": "https://github.com/naatukodi",
  "Bio": "Experienced Solution Architect with a strong background in technology and digital transformation. Possess expertise in cloud-native technologies, cloud environments, databases, scripting and automation. Proven track record of leading complex migration projects, driving digital innovation, and architecting serverless applications. Managed migrations across multiple locations, handling thousands of users and achieving significant cost savings. Seeking a Solution Architect position at a forward-thinking company to apply skills in architecture and technology transformation to support the company's digital innovation goals. Facilitated the adoption of Agile and Scrum practices to lead products toward cloud-native architectures on Azure, AWS, and GCP, designing and securing RESTful APIs with OAuth 2.0, Microsoft Graph API, and AWS API Gateway, and monitoring performance via Azure Log Analytics and Splunk. Assisted in implementing Infrastructure as Code (IaC) across multi-cloud using Terraform, ARM templates, and CloudFormation—provisioning VPCs, DNS records, GCP VPC networks, and containerized workloads; automated deployments with Ansible, Bash, and PowerShell scripts to reduce manual configuration effort. Navigated disaster recovery strategy design and execution for distributed systems, leveraging Azure Site Recovery, AWS Backup, and GCP Cloud Storage snapshots to ensure resilience and meet RTO/RPO targets. Established and led DevSecOps practices by integrating SAST, DAST, and SCA tools into the SDLC, using Docker benchmarks for container security and automated Python scripts for continuous vulnerability checks. Drove performance engineering in a Node.js/React.js environment with AppDynamics, scaling microservices tenfold through robust monitoring pipelines and cloud autoscaling across AWS, Azure, and GCP. Managed diverse data stores—Azure SQL, MS SQL, Cosmos DB, Redis, MongoDB, and other NoSQL solutions—integrating them via Spring Boot; architected GCP Bigtable and Firebase Realtime Database for high-throughput telemetry ingestion. Designed and deployed end-to-end IoT solutions using Azure IoT Hub to collect device telemetry, feeding data into NoSQL stores for real-time analytics and visualization. Built CI/CD pipelines in Jenkins and GitHub Actions to reduce deployment times and increase reliability, with automated infrastructure provisioning across all three clouds and Azure PaaS services. Deployed applications using Canary and Blue-Green strategies, ensuring zero-downtime updates; documented release processes and user stories with Visio for clear stakeholder communication. Managed cloud resources for VMs, containers, and PaaS offerings in Azure, AWS, and GCP—optimizing resource utilization and cost, defining network topologies (VPC, subnets, security groups) and DNS configurations. Initiated POCs in React.js and React Native, demonstrating technical leadership in program and people management to align development with business objectives and user stories. Executed comprehensive impact analyses for new features on existing distributed architectures, preventing contract or SLA breaches and guiding rapid rollback or mitigation plans."
}
